In [74]:
import pandas as pd
import numpy as np
data=pd.read_excel('1.4.2.xlsx', sheet_name="Лист1")
data

      T1   n     T2
0  31.10  20  30.92
1  77.31  50  77.76
2  77.30  50  77.75
3  77.31  50  77.74
4  77.31  50  77.71

In [75]:
#L=69.7
l2=12.3/100
l1=46.8/100
L=l1+l2

In [76]:
data=data.drop(0)
data

      T1   n     T2
1  77.31  50  77.76
2  77.30  50  77.75
3  77.31  50  77.74
4  77.31  50  77.71

In [77]:
data["t1"]=data.T1/data.n
data["t2"]=data.T2/data.n

In [78]:
data["g"]=(2*np.pi)**2*(l1**2-l2**2)/(data.t1**2*l1-data.t2**2*l2)
data

      T1   n     T2      t1      t2         g
1  77.31  50  77.76  1.5462  1.5552  9.800030
2  77.30  50  77.75  1.5460  1.5550  9.802571
3  77.31  50  77.74  1.5462  1.5548  9.798205
4  77.31  50  77.71  1.5462  1.5542  9.795469

In [79]:
print(data.g.mean(), np.std(data.g, ddof=1))

9.799068698867623 0.002994193102528049

In [80]:
print(data.style.to_latex(clines="all;data"))

\begin{tabular}{lrrrrrr}
 & T1 & n & T2 & t1 & t2 & g \\
1 & 77.310000 & 50 & 77.760000 & 1.546200 & 1.555200 & 9.800030 \\
\cline{1-7}
2 & 77.300000 & 50 & 77.750000 & 1.546000 & 1.555000 & 9.802571 \\
\cline{1-7}
3 & 77.310000 & 50 & 77.740000 & 1.546200 & 1.554800 & 9.798205 \\
\cline{1-7}
4 & 77.310000 & 50 & 77.710000 & 1.546200 & 1.554200 & 9.795469 \\
\cline{1-7}
\end{tabular}